import random
answers = ["Безперечно", "Мені здається - так", "Поки неясно, спробуй знову", "Навіть не думай",
            "Вирішено", "Найімовірніше", "Запитай пізніше", "Моя відповідь - ні",
            "Ніяких сумнівів", "Хороші перспективи", "Краще не розповідати", "За моїми даними - ні",
            "Можеш бути впевнений у цьому", "Так", "Сконцентруйся і запитай знову", "Дуже сумнівно"]
print('Привіт, я програма-гадалка, і я знаю відповідь на любе твоє питання.')
play = True
while play:
    input('Запийте щось: ')
    print(random.choice(answers))
    if input('Хочете запитати ще щось? (так/ні) ').lower() == 'ні':
        break
